[
    {
        "title": "Abstract",
        "sections": [
            {
                "title": null,
                "text": [
                    "Interactive notebooks can make bioinformatics data analyses more transparent, accessible and reusable. However, creating notebooks requires computer programming expertise. Here we introduce BioJupies, a web server that enables automated creation, storage, and deployment of Jupyter Notebooks containing RNA-seq data analyses. Through an intuitive interface, novice users can rapidly generate tailored reports to analyze and visualize their own raw sequencing files, their gene expression tables, or fetch data from >5,500 published studies containing >250,000 preprocessed RNA-seq samples. Generated notebooks have executable code of the entire pipeline, rich narrative text, interactive data visualizations, and differential expression and enrichment analyses. The notebooks are permanently stored in the cloud and made available online through a persistent URL. The notebooks are downloadable, customizable, and can run within a Docker container. By providing an intuitive user interface for notebook generation for RNA-seq data analysis, starting from the raw reads, all the way to a complete interactive and reproducible report, BioJupies is a useful resource for experimental and computational biologists. BioJupies is freely available as a web-based application from: <a href='http://biojupies.cloud' target='_blank'>http://biojupies.cloud</a> and as a Chrome extension from the <a href='https://chrome.google.com/webstore/detail/biojupies-generator/picalhhlpcjhonibabfigihelpmpadel' target='_blank'>Chrome Web Store</a>."
                ]
            }
        ]
    },
    {
        "title": "Generating Notebooks",
        "sections": [
            {
                "title": "Overview",
                "text": [
                    "BioJupies enables users to generate <b>customized analysis notebooks from RNA-seq data</b> through an intuitive interface, without requiring any knowledge of coding.",
                    "<div class='mt-2'></div>",
                    "Generating a notebook requires the following three steps:",
                    "<img src='entrypoint/workflow.png' class='mb-1'>",
                    "<ol><li><b>Select the data you wish to analyze</b>. You can upload your own RNA-seq data - either as raw FASTQ files or as a table containing gene counts - or search from over 9,000 publicly available datasets published in the <a href='https://www.ncbi.nlm.nih.gov/geo/' target='_blank'>Gene Expression Omnibus</a> (GEO) and processed by <a href='https://amp.pharm.mssm.edu/archs4/' target='_blank'>ARCHS4</a>.</li>",
                    "<li><b>Select data analysis tools</b>. After selecting the data, you can choose from over 10 data visualization and analysis tools. These tools will be used to analyze the RNA-seq dataset you uploaded or selected, and embed interactive figures in the resulting notebook.</li>",
                    "<li><b>Generate the notebook</b>. Once you have selected the set tools you wish to apply do the data, you can generate the notebook directly from the BioJupies website. The notebook will be returned to you through a permanent and public URL.</li></ol>"
                ]
            },
            {
                "title": "Getting Started",
                "text": [
                    "To start generating your notebook, please visit <a href='https://amp.pharm.mssm.edu/biojupies/analyze' target='_blank'>https://amp.pharm.mssm.edu/biojupies/analyze</a>.",
                    "<img src='entrypoint/get_started.png'>",
                    "First, you will be required to specify the <b>dataset you wish to analyze</b>. Three options are available:",
                    "<ol><li><b>Search Published Datasets</b>. The BioJupies search engine can be used to rapidly find datasets to analyze from over 9,000 publicly available published studies from GEO. Only studies that were processed by ARCHS4 are available for analysis with BioJupies.</li>",
                    "<li><b>Upload Your Dataset</b>. BioJupies enables you to upload your own RNA-seq dataset, either as raw FASTQ sequencing files, or as processed gene expression count tables.</li>",
                    "<li><b>Use the Example Dataset</b>. To learn how to generate a notebook with BioJupies, we provide an example dataset.</li></ol>"
                ]
            },
            {
                "title": "Uploading your Data",
                "text": [
                    "BioJupies allows you to generate customized analysis notebooks by uploading your own RNA-seq datasets.",
                    "To upload your data, visit <a href='https://amp.pharm.mssm.edu/biojupies/upload' target='_blank'>https://amp.pharm.mssm.edu/biojupies/upload</a>.",
                    "<img src='entrypoint/upload_data.png'>",
                    "<div class='mt-2'></div>",
                    "Data can be uploaded in two formats: <ol>",
                    "<li><b>Gene Count Tables.</b> If you already performed sequence alignment, you can upload text files containing raw gene counts. The files that you intend to upload must have gene symbols as the rows and samples as the columns. For more information on how to uploading gene counts tables, click <a href='#uploading_gene_counts'>here</a>.</li>",
                    "<li><b>FASTQ Files.</b> You can upload raw sequencing data stored in the .fastq.gz format directly to BioJupies. BioJupies will align your reads to the selected reference genome and generate a notebook from the estimated gene counts. For more information on how to upload FASTQ files for alignment, click <a href='#uploading_fastq_files'>here</a>.</li></ol>",
                    "<div class='mt-3'></div>",
                    "Once you have uploaded your data, proceed to <a href='#adding_analysis_plugins'>Adding Analysis Plugins</a>."
                ]
            },
            {
                "title": "Searching Published Data",
                "text": [
                    "In addition to uploading your data, BioJupies users can also analyze datasets avilable from over 9,000 published studies currently available from GEO.",
                    "<div class='mt-2'></div>",
                    "To search the pre-processed RNA-seq datasets indexed by BioJupies, visit <a href='https://amp.pharm.mssm.edu/biojupies/analyze/search' target='_blank'>https://amp.pharm.mssm.edu/biojupies/analyze/search</a>.",
                    "<img src='entrypoint/search.png'>",
                    "You can find datasets relevant to search terms by <b>submitting queries to the search engine</b>. The results are sorted by date of publication.Filters are available to select an organism, or the minimum and maximum number of samples contained within each dataset.",
                    "<div class='mt-3'></div>",
                    "The <span class='bg-lightgrey border-grey rounded px-2 py-1 micro text-muted'>More Info <i class='fa fa-angle-down ml-1'></i></span> buttons provide access to a detailed description of the dataset, as well as a link to its landing page on GEO.",
                    "<div class='mt-3'></div>",
                    "Once you have identified a dataset of interest, click on the <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Analyze <i class='fa fa-angle-right ml-1'></i></span> button to proceed to the <a href='#adding_analysis_plugins'>next step</a>."
                ]
            },
            {
                "title": "Adding Analysis Plugins",
                "text": [
                    "Once you have selected or uploaded a dataset to BioJupies, you can <b>select from a range of data analysis and visualization tools</b> to include in the final notebook report. The selected tools are plugins that will be used to <b>analyze the dataset</b> and <b>embed interactive plots</b> in the resulting notebook.",
                    "<img src='entrypoint/add_plugins.png'>",
                    "BioJupies currently supports a variety of RNA-seq data analysis plugin tools divided into <b>four categories</b>: Exploratory Data Analysis, Differential Expression Analysis, Enrichment Analysis, and Small Molecule Query.",
                    "<div class='mt-3'></div>",
                    "You can <b>toggle the inclusion or exclusion of plugin tools</b> by clicking on the <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Add <i class='fa fa-plus ml-1'></i></span> or <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Remove <i class='fa fa-minus ml-1'></i></span> buttons displayed on the right of each card. Additional information regarding each plugin, including links to interactive examples, and plugin source code on GitHub, are available by clicking on <span class='bg-lightgrey border-grey rounded px-2 py-1 micro text-muted'>More Info <i class='fa fa-angle-down ml-1'></i></span> .",
                    "<img src='entrypoint/plugin_info.png'>",
                    "Once you have selected the desired plugins, click <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Continue <i class='fa fa-angle-right ml-1'></i></span>.",
                    "<div class='mt-3'></div>",
                    "If you only selected plugin tools in the Exploratory Data Analysis category, proceed to <a href='#customizing_parameters'>Customizing Parameters</a>; otherwise proceed to <a href='#selecting_groups'>Selecting Groups</a>."
                ]
            },
            {
                "title": "Selecting Groups",
                "text": [
                    "If you selected one or more plugins in the <b>Differential Expression, Enrichment Analysis or Small Molecule Query</b> categories, you are required to specify <b>two groups of samples</b>.",
                    "<div class='mt-3'></div>",
                    "The two groups will be used to perform the <b>differential gene expression analysis</b>, and to identify a gene expression signature from the data. Groups are defined using the interface shown below:",
                    "<img src='entrypoint/selecting_groups.png'>",
                    "You can define the two groups of samples in two ways:",
                    "<ol><li><b>Specify the group names</b> in the input boxes provided. BioJupies will automatically predict the samples belonging to each group based on the sample metadata provided. You can turn off this feature by clicking on the toggle button displayed beside Predict Groups on the right.</li>",
                    "<li><b>Use the dropdown buttons</b> to manually select the samples assigned to each group.</li></ol>",
                    "<div class='mt-3'></div>",
                    "In order to improve the statistical validity of the differential expression analysis, BioJupies requires that <b>groups contain at least two RNA-seq samples</b>.",
                    "<div class='mt-3'></div>",
                    "Once you have selected the desired groups, click <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Continue <i class='fa fa-angle-right ml-1'></i></span> to proceed to the <a href='#customizing_parameters'>next step</a>."
                ]
            },
            {
                "title": "Customizing Parameters",
                "text": [
                    "After selecting the desired RNA-seq dataset and analysis plugin tools, you can <b>customize your notebook</b> by changing its title, adding subject tags, and modifying optional parameters for each of the selected plugins.",
                    "<img src='entrypoint/notebook_configuration.png'>",
                    "To customize your analysis, click on the <span class='bg-lightgrey border-grey rounded px-2 py-1 micro text-muted'>Modify Parameters <i class='fa fa-angle-down ml-1'></i></span> button displayed on the right of each plugin. BioJupies provides the ability to <b>modify the analysis parameters</b> for a subset of RNA-seq analysis plugin tools.",
                    "<img src='entrypoint/plugin_configuration.png'>",
                    "<div class='mt-3'></div>",
                    "Once you have selected the desired settings, click on <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Generate Notebook</span> to generate the report."
                ]
            },
            {
                "title": "Generating the Notebook",
                "text": [
                    "After clicking on <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Generate Notebook</span> a notebook generation job is submitted to the BioJupies server, and a loader is displayed on the webpage.",
                    "<img src='entrypoint/generating_notebook.png'>",
                    "The process of notebook generation typically takes <b>between 10 seconds to 3 minutes</b>, depending on the number of plugin tools selected and the size of the RNA-seq dataset."
                ]
            },
            {
                "title": "Accessing the Notebook",
                "text": [
                    "Once the notebook has been generated, a link is displayed on the BioJupies website.",
                    "<img src='entrypoint/notebook_result.png'>",
                    "To access the results of your analysis, click on <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Open Notebook</span>. The notebook is permanently stored on the BioJupies server and can be accessed at any time through the same persistent URL."
                ]
            }
        ]
    },
    {
        "title": "Uploading RNA-seq Data",
        "sections": [
            {
                "title": null,
                "text": [
                    "BioJupies enables users to <b>generate complete analysis notebooks from their own RNA-seq data</b> through an intuitive web interface with no knowledge of coding required. To start uploading your data, visit <a href='https://amp.pharm.mssm.edu/biojupies/upload' target='_blank'>https://amp.pharm.mssm.edu/biojupies/upload</a>.",
                    "<img src='entrypoint/upload_data.png'>",
                    "Data can be uploaded in two formats:<ol>",
                    "<li><b>Gene Count Tables.</b> If you already performed sequence alignment, you can upload text files containing raw gene counts. The files that you intend to upload must have gene symbols as the rows and samples as the columns. For more information on how to uploading gene counts tables, click <a href='#uploading_gene_counts'>here</a>.</li>",
                    "<li><b>FASTQ Files.</b> You can upload raw sequencing data stored in the .fastq.gz format directly to BioJupies. BioJupies will align your reads to the selected reference genome and generate a notebook from the estimated gene counts. For more information on how to upload FASTQ files for alignment, click <a href='#uploading_fastq_files'>here</a>.</li></ol>"
                ]
            },
            {
                "title": "Uploading Gene Counts",
                "text": [
                    "If your RNA-seq data has already been processed, you can upload a table containing of gene expression counts at <a href='https://amp.pharm.mssm.edu/biojupies/upload/table' target='_blank'>https://amp.pharm.mssm.edu/biojupies/upload/table</a>.",
                    "<img src='entrypoint/upload_table.png'>",
                    "In order to successfully upload an RNA-seq dataset, your file must have the following format:",
                    "<ul><li><b><a href='https://www.genenames.org/' target='_blank'>HGNC gene symbols</a> should be the first term in each row</b>. We recommend using HGNC gene symbols as the gene identifiers, since several of the plugin tools in the Enrichment Analysis and Small Molecule Query categories support these identifiers. BioJupies also supports other identifier systems such as <b>Ensembl IDs</b> and <b>Entrez IDs</b>; however, please note that the plugins in the enrichment analysis and small molecule queries may not return optimal results.</li>",
                    "<li>Have <b>sample names on the columns</b>.</li>",
                    "<li>Have <b>raw gene expression counts</b> as values. While users may successfully upload and analyze normalized RNA-seq datasets (such as FPKM values or log-transformed data) please note that the <b>analysis plugins are currently optimized for analysis of raw gene counts only</b>.</li>",
                    "<li>The uploaded table should be stored in one of the following formats: <b>.txt, .tsv, .csv, .xls</b> or <b>.xlsx</b>. An example gene expression table file can be downloaded <a href='app/static/data/biojupies_example_matrix.txt') }}' download>here</a>.</li></ul>"
                ]
            },
            {
                "title": "Uploading FASTQ Files",
                "text": [
                    "If you have raw RNA-seq data in FASTQ format, you can upload the files for analysis by BioJupies at <a href='https://amp.pharm.mssm.edu/biojupies/upload/reads' target='_blank'>https://amp.pharm.mssm.edu/biojupies/upload/reads</a>.",
                    "<img src='entrypoint/upload_reads_1.png'>",
                    "To upload your files, click on <button type='button' class='micro'>Choose Files</button> and <b>select the FASTQ files</b> you want to upload. Files must be <b>compressed using <a href='https://en.wikipedia.org/wiki/Gzip' target='_blank'>gzip</a></b> and <b>must not individually exceed 5GB</b> in size.",
                    "<div class='mt-3'></div>",
                    "Once you have selected the set of FASTQ files, click on <span class='bg-white border-blue text-primary rounded px-2 py-1 micro highlight'>Upload Files</span> . BioJupies will then upload the files and prepare them for alignment with <a href='https://amp.pharm.mssm.edu/cloudalignment/elysium.html' target='_blank'>Elysium</a>, our RNA-seq cloud alignment service.",
                    "<img src='entrypoint/upload_reads_2.png'>",
                    "<b>Upload may take between a minute to over an hour</b>, depending on the size of the files and on the speed of your internet connection.",
                    "<div class='mt-3'></div>",
                    "Once the upload process is completed, the <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Continue <i class='fa fa-angle-right ml-1'></i></span> button will be activated and you will be able to proceed to the <a href='#launching_alignment_jobs'>next step</a>."
                ]
            },
            {
                "title": "Launching Alignment Jobs",
                "text": [
                    "After the FASTQ files have been uploaded, you can configure the alignment process using the interface shown below:",
                    "<img src='entrypoint/align_reads.png'>",
                    "In order to estimate expression levels for each gene, you need to specify two parameters:",
                    "<ol><li>The <b>organism</b> from which the RNA-seq samples were generated. This parameter will be used to select the reference genome for the alignment.</li>",
                    "<li>Whether the FASTQ files were generated using <b>single-or paired-end sequencing</b>.</li></ol>",
                    "By selecting <b>single-end sequencing</b>, the FASTQ files will be individually aligned to the reference genome and will each return one column in the resulting dataset.",
                    "<img src='entrypoint/single_end.png'>",
                    "When selecting <b>paired-end sequencing</b>, you will be asked to specify which pairs of FASTQ files have been generated from the same biological sample.",
                    "<div class='mt-3'></div>",
                    "The pairs will be used to perform paired alignment and will each return one column in the resulting dataset. Samples can be optionally renamed to be more descriptive using the text boxes provided.",
                    "<img src='entrypoint/paired_end.png'>",
                    "Once you have selected the desired alignment settings, click <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Continue <i class='fa fa-angle-right ml-1'></i></span> to launch the alignment jobs, then proceed to the <a href='#viewing_job_status'>next step</a>."
                ]
            },
            {
                "title": "Viewing Job Status",
                "text": [
                    "Once the alignment jobs are launched, you will be redirected to a page displaying the status of each job.",
                    "<img src='entrypoint/alignment_status.png'>",
                    "Alignment jobs may have four statuses:",
                    "<ul class='mt-2'><li class='nomargin'><img src='https://amp.pharm.mssm.edu/cloudalignment/images/pending.png' class='w-50px nomargin py-1 pr-2'><b>Waiting</b>. This indicates that your sample is in the queue. It will be executed when resources are available.</li>",
                    "<li class='nomargin'><img src='https://amp.pharm.mssm.edu/cloudalignment/images/submitted.png' class='w-50px nomargin py-1 pr-2'><b>Submitted</b>. This indicates that the job is currently executing.</li>",
                    "<li class='nomargin'><img src='https://amp.pharm.mssm.edu/cloudalignment/images/completed.png' class='w-50px nomargin py-1 pr-2'><b>Completed</b>. This indicates that the job was completed successfully.</li>",
                    "<li class='nomargin'><img src='https://amp.pharm.mssm.edu/cloudalignment/images/error.png' class='w-50px nomargin py-1 pr-2'><b>Failed</b>. This indicates the job has failed.</li></ul>",
                    "Most jobs should be complete in <b>around 10-15 minutes</b>. BioJupies currently supports concurrent alignment of two jobs at a time. If users requests more than two jobs at the same times, the additional jobs will be added to the queue.",
                    "<div class='mt-3'></div>",
                    "The alignment jobs will <b>continue to run</b> if the user exits the page. The job status will remain accessible from the same unique URL.",
                    "<div class='mt-3'></div>",
                    "Once the alignment jobs are all completed, click <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Continue <i class='fa fa-angle-right ml-1'></i></span> to proceed to the <a href='#adding_sample_metadata'>next step</a>."
                ]
            },
            {
                "title": "Adding Sample Metadata",
                "text": [
                    "Before analyzing your RNA-seq data, BioJupies asks that you <b>add information that better describes the samples</b> contained within your dataset. Such information can be the experimental group the sample belongs, for example, wild type vs. knock-out, normal vs. diseased.",
                    "<div class='mt-3'></div>",
                    "This information can be used to <b>extract knowledge</b> from the data more efficiently in the subsequent downstream analysis steps.",
                    "<img src='entrypoint/add_metadata.png'>",
                    "You can add information about your RNA-seq samples in two ways:",
                    "<ol><li>By <b>manually specifying groups</b> the samples belong to, using the text boxes on the left.</li>",
                    "<li>By <b>uploading a table</b> containing information about the specified samples. The table must have sample names on the rows, and can contain any number of columns specifying different properties of the uploaded samples. An example metadata file can be downloaded <a href='app/static/data/biojupies_example_metadata.txt') }}' download>here</a>.</li></ol>",
                    "Once you have added the required information, click <span class='bg-blue border-grey rounded px-2 py-1 micro text-white'>Continue <i class='fa fa-angle-right ml-1'></i></span> to upload your dataset to BioJupies. You can then proceed to <a href='#adding_analysis_plugins'>Adding Analysis Plugins</a>."
                ]
            }
        ]
    },
    {
        "title": "Chrome Extension",
        "sections": [
            {
                "title": null,
                "text": [
                    "In addition to the BioJupies web server, BioJupies is also freely available for download as a <b>Chrome browser extension</b>. The extension adds functionality to the Geo DataSet browser (<a href='https://www.ncbi.nlm.nih.gov/gds' target='_blank'>https://www.ncbi.nlm.nih.gov/gds</a>), and is available for download from the Google Chrome Store.",
                    "<div class='mt-3'></div>",
                    "The BioJupies Chrome extension embeds buttons and a user interface that enable users to <b>automatically generate notebooks directly from the GEO website</b>. With the Chrome extension users can launch BioJupies notebooks without having to leave the GEO website."
                ]
            },
            {
                "title": "Installing the BioJupies Chrome Extension",
                "text": [
                    "The Chrome Extension can be installed for free from the Chrome Web Store at the following URL: <a href='https://chrome.google.com/webstore/detail/biojupies-generator/picalhhlpcjhonibabfigihelpmpadel?hl=en-US' target='_blank'>https://chrome.google.com/webstore/detail/biojupies-generator/picalhhlpcjhonibabfigihelpmpadel</a>.",
                    "<img src='entrypoint/chrome_webstore.png'>",
                    "To install the extension, click on the <b>Add to Chrome</b> button displayed on the web store. Once installed, the BioJupies icon will be displayed on the top right corner of your Chrome window."
                ]
            },
            {
                "title": "Searching Data",
                "text": [
                    "Once the Chrome Extension is installed, it will be activated on the <b>GEO DataSet browser</b>.",
                    "<div class='mt-2'></div>",
                    "The extension adds a <img src='entrypoint/chrome_button.png' class='nomargin h-50px'> button near each RNA-seq dataset. Only studies that have processed RNA-seq data from ARCHS4 are available for analysis using BioJupies.",
                    "<div class='mt-3'></div>",
                    "An example is shown below for the GEO series GSE88741 (<a href='https://www.ncbi.nlm.nih.gov/gds/?term=GSE88741' target='_blank'>https://www.ncbi.nlm.nih.gov/gds/?term=GSE88741</a>).",
                    "<img src='entrypoint/geo_search.png'>",
                    "By clicking on the button, users can proceed to <a href='#adding_analysis_plugins_'>Adding Analysis Plugins</a> in order to <b>generate a customized Jupyter Notebook</b> from the selected dataset entirely through a pop-up window user interface.",
                    "<div class='mt-3'></div>",
                    "Note: <b>BioJupies currently supports ~9,000 RNA-seq datasets</b> processed by <a href='https://amp.pharm.mssm.edu/archs4/' target='_blank'>ARCHS4</a>. Since the Gene Expression Omnibus indexes a large number of datasets which have not been generated using RNA-sequencing, <b>many search results will not have a Generate Notebook button</b>.",
                    "<div class='mt-3'></div>",
                    "For a complete list of processed datasets see <a href='https://amp.pharm.mssm.edu/biojupies/analyze/search' target='_blank'>https://amp.pharm.mssm.edu/biojupies/analyze/search</a>."
                ]
            },
            {
                "title": "Adding Analysis Plugins ",
                "text": [
                    "After clicking on the Generate Notebook button, you can <b>add one or more RNA-seq analysis plugin tools</b> using the interface shown below. The selected plugins will be used to <b>analyze the dataset and embed interactive plots</b> in the resulting notebook.",
                    "<img src='entrypoint/chrome_adding_plugins.png'>",
                    "You can <b>toggle the inclusion or exclusion of plugins</b> by clicking on each tool's card. Once you have selected the desired set of plugin tools, click on <span class='bg-lightgrey border-grey rounded px-2 py-1 micro text-muted'>Next</span> .",
                    "<div class='mt-3'></div>",
                    "If you only selected plugin tools from the Exploratory Data Analysis category, proceed to <a href='#customizing_parameters_'>Customizing Parameters</a>; otherwise proceed to <a href='#selecting_groups_'>Selecting Groups</a>."
                ]
            },
            {
                "title": "Selecting Groups ",
                "text": [
                    "If you selected one or more plugins from the <b>Differential Expression, Enrichment Analysis or Small Molecule Query</b> categories, you are asked to specify <b>two groups of samples</b>.",
                    "<div class='mt-3'></div>",
                    "The two groups will be used to perform the <b>differential gene expression analysis</b>, and to identify a gene expression signature from the data. Groups are defined using the interface below:",
                    "<img src='entrypoint/chrome_adding_groups.png'>",
                    "To define the groups of samples:",
                    "<ol><li><b>Select the IDs on the left column</b> to assign samples to Group A.</li>",
                    "<li><b>Select the IDs on the right column</b> to assign samples to Group B.</li>",
                    "<li>It is recommended that you <b>renname the groups</b> using the text boxes displayed at the bottom of the window to make the group names more descriptive.</li></ol>",
                    "<div class='mt-3'></div>",
                    "In order to improve the statistical validity of the differential expression analysis, BioJupies requires that <b>each group must contain at least three RNA-seq samples</b>.",
                    "<div class='mt-3'></div>",
                    "Once you selected and labeled the two groups, click <span class='bg-lightgrey border-grey rounded px-2 py-1 micro text-muted'>Next</span> to proceed to the <a href='#customizing_parameters_'>next step</a>."
                ]
            },
            {
                "title": "Customizing Parameters ",
                "text": [
                    "After selecting the desired RNA-seq dataset and choosing the analysis plugin tools, you can <b>customize your notebook</b> by changing its title, as well as modify other optional parameters for each of the selected tools.",
                    "<img src='entrypoint/chrome_notebook_configuration.png'>",
                    "To customize your analysis, click on the <i class='fa fa-caret-down text-muted mx-1'></i> button displayed on the right of each plugin name. BioJupies enables you to optionally <b>modify analysis parameters</b> for a subset of RNA-seq analysis plugins.",
                    "<div class='mt-3'></div>",
                    "Once you have selected the desired settings, click on <span class='bg-lightgrey border-grey rounded px-2 py-1 micro text-muted'>Generate Notebook</span> to generate the analysis."
                ]
            },
            {
                "title": "Generating the Notebook ",
                "text": [
                    "After clicking on <span class='bg-lightgrey border-grey rounded px-2 py-1 micro text-muted'>Generate Notebook</span> a notebook generation job is submitted to the BioJupies server, and a loader is displayed in the window.",
                    "<img src='entrypoint/chrome_generating_notebook.png'>",
                    "The process of notebook generation typically takes <b>between 10 seconds to 3 minutes</b>, depending on the number of plugins selected and the size of the RNA-seq dataset."
                ]
            },
            {
                "title": "Accessing the Notebook ",
                "text": [
                    "Once the notebook is generated, a link is displayed in the resultant window.",
                    "<img src='entrypoint/chrome_notebook_link.png'>",
                    "To access the report of your analysis, click on <span class='bg-primary border-grey rounded px-2 py-1 micro text-white'>Open Notebook</span>. The notebook is permanently stored on the BioJupies web server and can be accessed at any time through the same persistent URL."
                ]
            }
        ]
    },
    {
        "title": "Video Tutorials",
        "sections": [
            {
                "title": "1. Introduction",
                "text": [
                    "<iframe class='mt-2 mb-3 d-block' width='560' height='315' src='https://www.youtube.com/embed/_fSLXH95ggY' frameborder='0' allow='autoplay; encrypted-media' allowfullscreen></iframe>Introduction to the BioJupies web server and video tutorial playlist."
                ]
            },
            {
                "title": "2. Aligning FASTQ Files",
                "text": [
                    "<iframe class='mt-2 mb-3 d-block' width='560' height='315' src='https://www.youtube.com/embed/Pc9XGImptPo' frameborder='0' allow='autoplay; encrypted-media' allowfullscreen></iframe>Step-by-step demonstration on uploading raw FASTQ files and launching alignment jobs from the BioJupies web server."
                ]
            },
            {
                "title": "3. Generating a Jupyter Notebook",
                "text": [
                    "<iframe class='mt-2 mb-3 d-block' width='560' height='315' src='https://www.youtube.com/embed/LYfdYnf8YdE' frameborder='0' allow='autoplay; encrypted-media' allowfullscreen></iframe>Instructions on generating a custom Jupyter Notebook from uploaded FASTQ files."
                ]
            },
            {
                "title": "4. Exploring a Jupyter Notebook",
                "text": [
                    "<iframe class='mt-2 mb-3 d-block' width='560' height='315' src='https://www.youtube.com/embed/rgJFn3Le0e8' frameborder='0' allow='autoplay; encrypted-media' allowfullscreen></iframe>Exploring the results contained within a Jupyter Notebook generated using BioJupies."
                ]
            },
            {
                "title": "5. Using the Chrome Extension",
                "text": [
                    "<iframe class='mt-2 mb-3 d-block' width='560' height='315' src='https://www.youtube.com/embed/hb4J7z57CtQ' frameborder='0' allow='autoplay; encrypted-media' allowfullscreen></iframe>Instructions on installing and using the BioJupies Google Chrome extension. For more information please refer to the <a href='#chrome_extension'>Chrome Extension</a> section."
                ]
            },
            {
                "title": "6. Reusing Notebooks",
                "text": [
                    "<iframe class='mt-2 mb-3 d-block' width='560' height='315' src='https://www.youtube.com/embed/NZDV4z-ZCqc' frameborder='0' allow='autoplay; encrypted-media' allowfullscreen></iframe>Overview of how users can download, execute and customize BioJupies Notebooks on their local computer (Mac OS shown). For more information about this topic please refer to the <a href='#reusing_notebooks'>Reusing Notebooks</a> section."
                ]
            }
        ]
    },
    {
        "title": "Troubleshooting",
        "sections": [
            {
                "title": null,
                "text": [
                    "This section contains <b>instructions on troubleshooting issues related to BioJupies notebooks</b>.",
                    "<ul><li>For information on the components required to render notebooks, see <a href='#software_requirements'>Software Requirements</a>.</li>",
                    "<li>If you are experiencing issues visualizing notebooks, see <a href='#troubleshooting_notebooks'>Troubleshooting Notebooks</a>.</li>",
                    "<li>If you wish to generate static notebooks, see <a href='#generating_static_notebooks'>Generating Static Notebooks</a>.</li></ul>"
                ]
            },
            {
                "title": "Software Requirements",
                "text": [
                    "BioJupies relies on the following software to generate and display notebooks:",
                    "<ol><li><b>Jupyter Notebook</b> (<a href='http://jupyter.org/' target='_blank'>http://jupyter.org/</a>) to create notebook files.</li>",
                    "<li><b>Jupyter nbviewer</b> (<a href='http://nbviewer.jupyter.org/' target='_blank'>http://nbviewer.jupyter.org/</a>) to render notebooks online.</li>",
                    "<li><b>WebGL</b> (<a href='https://www.khronos.org/webgl/' target='_blank'>https://www.khronos.org/webgl/</a>) to display interactive 2D and 3D visualizations.</li></ol>",
                    "Support for WebGL is present in Firefox 4+, Google Chrome 9+, Opera 12+, Safari 5.1+, Internet Explorer 11+, and Microsoft Edge build 10240+. However, the user's device must also have hardware that supports these features."
                ]
            },
            {
                "title": "Troubleshooting Notebooks",
                "text": [
                    "In some cases, <b>users may experience issues visualizing interactive plots</b> on generated notebooks. These may include:",
                    "<ul><li><b>Plots appearing blank in the notebook</b>. This is likely caused by an error loading WebGL on your browser. The issue can be usually resolved by clicking on the empty plot area, refreshing the notebook URL, or opening the URL on a different window or browser.</li>",
                    "<li>Plots displaying the <b>\"WebGL is not supported by your browser\"</b> error message. This issue is commonly resolved by updating your browser to the newest available version. </li>",
                    "<li><b>Notebooks only displaying partially</b>. This issue may be caused by an issue with the nbviewer notebook rendering service, or by an error loading WebGL on your browser. This is commonly resolved by refreshing the notebook URL, or opening the URL on a different window or browser. </li></ul>",
                    "<div class='mt-3'></div>",
                    "If one or more of these issues persist, follow the instructions below to <a href='#generating_static_notebooks'>Generate Static Notebooks</a>."
                ]
            },
            {
                "title": "Generating Static Notebooks",
                "text": [
                    "If you are experiencing problems displaying interactive visualizations, BioJupies provides you with the option to <b>generate notebooks containing static plots</b>.",
                    "Since static plots do not require WebGL and necessitate less memory to render, this option will allow generated notebooks to be displayed more reliably.",
                    "<div class='mt-3'></div>",
                    "The option can be selected in two ways. First, you can <b>toggle it on individual plots</b> by selecting the Plot Type: 'static' parameter in the final step of notebook generation, as shown below:",
                    "<img src='entrypoint/static_pca.png' class='my-3'>",
                    "Second, you can <b>toggle the option for all plots in a notebook</b> by selecting the \"Would you like your notebook to only display static plots?\" option, as shown below:",
                    "<img src='entrypoint/static_notebook.png' class='my-3'>",
                    "By selecting this, BioJupies will force all plots to be displayed statically in the final Jupyter Notebook."
                ]
            }
        ]
    },
    {
        "title": "Citation",
        "sections": [
            {
                "title": null,
                "text": [
                    "BioJupies is currently available on Cell Systems at <a href='https://www.cell.com/cell-systems/fulltext/S2405-4712(18)30432-0' target='_blank'>https://www.cell.com/cell-systems/fulltext/S2405-4712(18)30432-0</a>."
                ]
            }
        ]
    },
    {
        "title": "Terms of Use",
        "sections": [
            {
                "title": null,
                "text": [
                    "Source code for BioJupies is available at <a href='https://github.com/MaayanLab/biojupies' target='_blank'>https://github.com/MaayanLab/biojupies</a> under the <a href='http://www.apache.org/licenses/LICENSE-2.0' target='_blank'>Apache License 2.0</a>.",
                    "<div class='mt-3'></div>",
                    "Provided gene expression files are available under the <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank'>Creative Commons Attribution 4.0 International License</a>.",
                    "<div class='mt-3'></div>",
                    "BioJupies is free to use for non-commercial purposes. Commercial users should contact <a href='http://www.ip.mountsinai.org/' target='_blank'>MSIP</a>."
                ]
            }
        ]
    }
]